gw826943555/hal_gigadevice/gd32f527/standard_peripheral/source/gd32f527_i2c_add.c
    /* get the status of interrupt enable bit */
    ret1 = (I2C_ADD_REG_VAL(i2c_add_periph, int_flag) & BIT(I2C_ADD_BIT_POS(int_flag)));
    /* get the status of interrupt flag */
    ret2 = (I2C_ADD_REG_VAL2(i2c_add_periph, int_flag) & BIT(I2C_ADD_BIT_POS2(int_flag)));
    if(ret1 && ret2) {
        result = SET;
    } else {
        result = RESET;
    }
    return result;
}

/*!
    \brief      clear I2C interrupt flag status
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  int_flag: I2C interrupt flags, refer to i2c_add_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        I2C_ADD_INT_FLAG_ADDSEND: address received matches in slave mode interrupt flag
      \arg        I2C_ADD_INT_FLAG_NACK: not acknowledge interrupt flag
      \arg        I2C_ADD_INT_FLAG_STPDET: stop condition detected in slave mode interrupt flag
      \arg        I2C_ADD_INT_FLAG_BERR: bus error interrupt flag
      \arg        I2C_ADD_INT_FLAG_LOSTARB: arbitration lost interrupt flag
      \arg        I2C_ADD_INT_FLAG_OUERR: overrun/underrun error in slave mode interrupt flag
      \arg        I2C_ADD_INT_FLAG_PECERR: PEC error interrupt flag
      \arg        I2C_ADD_INT_FLAG_TIMEOUT: timeout interrupt flag
      \arg        I2C_ADD_INT_FLAG_SMBALT: SMBus Alert interrupt flag
    \param[out] none
    \retval     none
*/
void i2c_add_interrupt_flag_clear(uint32_t i2c_add_periph, i2c_add_interrupt_flag_enum int_flag)
{
    I2C_ADD_STATC(i2c_add_periph) |= BIT(I2C_ADD_BIT_POS2(int_flag));
}
